app/controllers/api/episodes_controller.rb

SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @episode = Episode.find_by(id: params[:id])