app/controllers/api/movies_controller.rb

def index
    @movies = Movie.with_attached_photo.with_attached_video.all
---
SELECT "movies".* FROM "movies"

def show
    @movie = Movie.find_by(id: params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]