app/controllers/api/shows_controller.rb

    def index
        @shows = Show.includes(:episodes, :genres).with_attached_photo
---
SELECT "episodes".* FROM "episodes" WHERE "episodes"."show_id" IN ($1, $2, $3, $4)  [["show_id", 1], ["show_id", 2], ["show_id", 3], ["show_id", 4]]
SELECT "shows".* FROM "shows" INNER JOIN "episodes" ON "episodes"."show_id" = "shows"."id"

    def show
        @show = Show.includes(:episodes).with_attached_photo.find(params[:id])
---
SELECT  "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "episodes".* FROM "episodes" WHERE "episodes"."show_id" = $1  [["show_id", 1]]