app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "10OjX-v2sJpXWLTbH_1pSw"], ["updated_at", "2019-05-24 20:15:16.768773"], ["id", 2]]
---
    def create
        @user = User.create(user_params)
        if @user.save