app/views/api/shows/_show.json.jbuilder

    json.episode_ids do
        json.array! @show.episodes.ids
---
SELECT "episodes"."id" FROM "episodes" WHERE "episodes"."show_id" = $1  [["show_id", 1]]