app/views/api/shows/index.json.jbuilder

SELECT "episodes"."id" FROM "episodes" WHERE "episodes"."show_id" = $1  [["show_id", 1]]
---
        json.episode_ids do
            json.array! show.episodes.ids