app/views/api/shows/show.json.jbuilder

SELECT "episodes"."id" FROM "episodes" WHERE "episodes"."show_id" = $1  [["show_id", 1]]
---
json.set! "episodes" do
    @show.episodes.each do |episode|