app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "JyjkM7fpIhlAenAeYQOB-A"], ["updated_at", "2019-05-27 18:14:13.313032"], ["id", 1]]
---
    def reset_session_token!
        self.update!(session_token: SecureRandom::urlsafe_base64)